how_to_checkout_repo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HOW TO CHECK OUT YOUR REPO</title>
<!-- 2015-03-09 Mon 17:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">HOW TO CHECK OUT YOUR REPO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Figuring out your Repo URL</a></li>
<li><a href="#sec-2">2. Checking out on the command line</a></li>
<li><a href="#sec-3">3. Checking out in Eclipse</a></li>
<li><a href="#sec-4">4. If you don't have your SVN Password</a></li>
</ul>
</div>
</div>
<p>
So we'll be submitting most of our assignments via SVN, as you used in
your CSSE120/220/230 classes.  As many of our assignments will be
java, you may use eclipse to manage them.  Or you can use any editor
you prefer, but I won't be making projects or testing that builds work
in the case.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Figuring out your Repo URL</h2>
<div class="outline-text-2" id="text-1">
<p>
To do that you need to figure out your year code.  Your year code is
the year of the later part of the academic term (so if it is the
2014-2015 term, the year is 2015) followed by either 10 (fall) 20
(winter) or 30 (spring).
</p>

<p>
Once you know that, your repo url should be:
<a href="http://svn.csse.rose-hulman.edu/repos/csseCOURSENUM-YEARCODE-YOURNETID">http://svn.csse.rose-hulman.edu/repos/csseCOURSENUM-YEARCODE-YOURNETID</a>
</p>

<p>
So for example, if I was taking CSSE375 in Spring 2014-2015, my
url would be:
</p>

<p>
<a href="http://svn.csse.rose-hulman.edu/repos/csse375-201530-hewner">http://svn.csse.rose-hulman.edu/repos/csse375-201530-hewner</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Checking out on the command line</h2>
<div class="outline-text-2" id="text-2">
<p>
Once you have the URL, you can checkout like this:
</p>

<pre class="example">
svn co http://svn.csse.rose-hulman.edu/repos/csse375-201530-hewner
</pre>

<p>
Use svn commit to make changes to your repo.
Use svn update to get new homework assignments when they're released.
</p>

<p>
If you're not sure how to use svn, try asking a friend or online
tutorial.  But I'm always available as a backup if that doesn't work
:D.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Checking out in Eclipse</h2>
<div class="outline-text-2" id="text-3">
<p>
First, you need to install the subclipse plugin to eclipse.  Download and install it from here: 
</p>

<p>
<a href="http://subclipse.tigris.org">http://subclipse.tigris.org</a>
</p>

<p>
Then go to
</p>

<p>
Window menu &gt; Show View &gt; Other &gt; SVN &gt; Svn Repositories
</p>

<p>
That should open the svn repositories view.  Then right click in the window and select New Repository Location.  From there, a dialog should appear that you add your URL to.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> If you don't have your SVN Password</h2>
<div class="outline-text-2" id="text-4">
<p>
You'll need to use your svn password to check it out.  If you need
it reset, email me.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-03-09 Mon 17:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
